Revit 2024 API
UnitTypeId.StationingSurveyFeet Property
 US survey feet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId StationingSurveyFeet { get; }
Visual Basic
Public Shared ReadOnly Property StationingSurveyFeet As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StationingSurveyFeet {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace